Revit 2027 API
SystemZoneElementType.CoolingSetPoint Property
 The cooling temperature set point in unit Kelvin (K).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CoolingSetPoint { get; set; }
Public Property CoolingSetPoint As Double
	Get
	Set
public:
property double CoolingSetPoint {
	double get ();
	void set (double value);
}
member CoolingSetPoint : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property:
See Also
Reference
SystemZoneElementType Class
Autodesk.Revit.DB.Mechanical Namespace